In [1]:
import numpy as np
import pandas as pd

In [4]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [7]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [8]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [10]:
from numpy import nan as NA

In [11]:
data = pd.Series([1, NA, 3.5, NA, 14])
data.dropna()

0     1.0
2     3.5
4    14.0
dtype: float64

In [12]:
data[data.notnull()]

0     1.0
2     3.5
4    14.0
dtype: float64

In [21]:
data = pd.DataFrame([[1., 5.6, 3.], [12., NA, NA], [NA, NA, NA], [NA, 6.5, 31]])

In [22]:
cleaned = data.dropna()

In [23]:
data

      0    1     2
0   1.0  5.6   3.0
1  12.0  NaN   NaN
2   NaN  NaN   NaN
3   NaN  6.5  31.0

In [24]:
cleaned

     0    1    2
0  1.0  5.6  3.0

In [25]:
data.dropna(how='all')

      0    1     2
0   1.0  5.6   3.0
1  12.0  NaN   NaN
3   NaN  6.5  31.0

In [26]:
data[4] = NA

In [27]:
data

      0    1     2   4
0   1.0  5.6   3.0 NaN
1  12.0  NaN   NaN NaN
2   NaN  NaN   NaN NaN
3   NaN  6.5  31.0 NaN

In [28]:
data.dropna(axis=1, how='all')

      0    1     2
0   1.0  5.6   3.0
1  12.0  NaN   NaN
2   NaN  NaN   NaN
3   NaN  6.5  31.0

In [29]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -1.473292       NaN       NaN
1 -1.174894       NaN       NaN
2  1.715690       NaN -2.086814
3  0.723699       NaN -0.154933
4  0.209436  0.375216  0.855498
5 -0.251961 -1.601252 -0.085753
6  0.907586 -1.215920 -1.222291

In [30]:
df.dropna()

          0         1         2
4  0.209436  0.375216  0.855498
5 -0.251961 -1.601252 -0.085753
6  0.907586 -1.215920 -1.222291

In [36]:
df.dropna(thresh=1)

          0         1         2
0 -1.473292       NaN       NaN
1 -1.174894       NaN       NaN
2  1.715690       NaN -2.086814
3  0.723699       NaN -0.154933
4  0.209436  0.375216  0.855498
5 -0.251961 -1.601252 -0.085753
6  0.907586 -1.215920 -1.222291

In [37]:
df.dropna(thresh=2)

          0         1         2
2  1.715690       NaN -2.086814
3  0.723699       NaN -0.154933
4  0.209436  0.375216  0.855498
5 -0.251961 -1.601252 -0.085753
6  0.907586 -1.215920 -1.222291

In [35]:
df.dropna(thresh=3)

          0         1         2
4  0.209436  0.375216  0.855498
5 -0.251961 -1.601252 -0.085753
6  0.907586 -1.215920 -1.222291

In [38]:
df.fillna(0)

          0         1         2
0 -1.473292  0.000000  0.000000
1 -1.174894  0.000000  0.000000
2  1.715690  0.000000 -2.086814
3  0.723699  0.000000 -0.154933
4  0.209436  0.375216  0.855498
5 -0.251961 -1.601252 -0.085753
6  0.907586 -1.215920 -1.222291

In [40]:
df.fillna({1: 1.5, 2: 0})

          0         1         2
0 -1.473292  1.500000  0.000000
1 -1.174894  1.500000  0.000000
2  1.715690  1.500000 -2.086814
3  0.723699  1.500000 -0.154933
4  0.209436  0.375216  0.855498
5 -0.251961 -1.601252 -0.085753
6  0.907586 -1.215920 -1.222291

In [41]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -1.473292  0.000000  0.000000
1 -1.174894  0.000000  0.000000
2  1.715690  0.000000 -2.086814
3  0.723699  0.000000 -0.154933
4  0.209436  0.375216  0.855498
5 -0.251961 -1.601252 -0.085753
6  0.907586 -1.215920 -1.222291

In [42]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0 -0.708688  0.756635  2.723541
1 -0.834449 -0.111002 -0.443952
2 -0.505367       NaN -0.303417
3  2.310206       NaN  0.138297
4 -0.281379       NaN       NaN
5 -0.431044       NaN       NaN

In [43]:
df.fillna(method='ffill')

          0         1         2
0 -0.708688  0.756635  2.723541
1 -0.834449 -0.111002 -0.443952
2 -0.505367 -0.111002 -0.303417
3  2.310206 -0.111002  0.138297
4 -0.281379 -0.111002  0.138297
5 -0.431044 -0.111002  0.138297

In [44]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -0.708688  0.756635  2.723541
1 -0.834449 -0.111002 -0.443952
2 -0.505367 -0.111002 -0.303417
3  2.310206 -0.111002  0.138297
4 -0.281379       NaN  0.138297
5 -0.431044       NaN  0.138297

In [45]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64